tutorials/compressible/PBNS/cpbnsPIMPLE/compressiblePitzDaily/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.0001;
        smoother        USGS;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    algebraicPair;
        mergeLevels     1;
        minIter         1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          1e-06;
        smoother        USGS;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    algebraicPair;
        mergeLevels     1;
        minIter         1;
    }

    "(rho|U|h|k|epsilon|omega)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.001;
        smoother        USGS;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    algebraicPair;
        mergeLevels     1;
    }
    "(rho|U|h|k|epsilon|omega)Final"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          1e-05;
        smoother        USGS;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    algebraicPair;
        mergeLevels     1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  1;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
    rhoMin            rhoMin [ 1 -3 0 0 0 ] 0.0001;
    rhoMax            rhoMax [ 1 -3 0 0 0 ] 1000.0;
}

relaxationFactors
{
    U               1.0;
    p               1.0;
    h               1.0;
    rho             1.0;
    T               1.0;
}

// ************************************************************************* //
